app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-09 18:56:51.465551"], ["updated_at", "2018-11-09 18:56:51.465551"]]
---
  def create
    @school_class = SchoolClass.create(params.require(:school_class))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-11-10 03:40:19.482466"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @student.update(params.require(:school_class))