app/controllers/students_controller.rb

  def create
    @student = Student.create(params.require(:student))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-11-09 18:57:57.547729"], ["updated_at", "2018-11-09 18:57:57.547729"]]

  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:student))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-11-10 03:34:32.700825"], ["id", 1]]